{"import":0,"ctypes":1,"importlib":2,"util":3,"json":4,"logging":5,"os":6,"re":7,"shutil":8,"subprocess":9,"sys":10,"from":11,"pathlib":12,"path":13,"which":14,"torch":15,"packaging":16,"version":17,"parse":18,"setuptools":19,"extension":20,"setup":21,"command":22,"build_ext":23,"setuptools_scm":24,"get_version":25,"utils":26,"cpp_extension":27,"cuda_home":28,"rocm_home":29,"def":30,"load_module_from_path":31,"module_name":32,"spec":33,"spec_from_file_location":34,"module":35,"module_from_spec":36,"modules":37,"loader":38,"exec_module":39,"return":40,"root_dir":41,"__file__":42,"parent":43,"logger":44,"getlogger":45,"__name__":46,"cannot":47,"envs":48,"directly":49,"because":50,"depends":51,"vllm":52,"installed":53,"yet":54,"join":55,"py":56,"vllm_target_device":57,"platform":58,"startswith":59,"darwin":60,"cpu":61,"warning":62,"automatically":63,"set":64,"due":65,"macos":66,"elif":67,"linux":68,"only":69,"supports":70,"including":71,"wsl":72,"building":73,"so":74,"may":75,"able":76,"run":77,"correctly":78,"empty":79,"cuda":80,"none":81,"getenv":82,"hip":83,"available":84,"fallback":85,"main_cuda_version":86,"12":87,"is_sccache_available":88,"bool":89,"sccache":90,"int":91,"vllm_disable_sccache":92,"is_ccache_available":93,"ccache":94,"is_ninja_available":95,"ninja":96,"is_url_available":97,"url":98,"str":99,"urllib":100,"request":101,"urlopen":102,"status":103,"try":104,"except":105,"exception":106,"false":107,"200":108,"class":109,"cmakeextension":110,"__init__":111,"self":112,"name":113,"cmake_lists_dir":114,"kwa":115,"super":116,"sources":117,"py_limited_api":118,"true":119,"abspath":120,"cmake_build_ext":121,"dict":122,"directories":123,"have":124,"been":125,"configured":126,"did_config":127,"determine":128,"number":129,"compilation":130,"jobs":131,"optionally":132,"nvcc":133,"compile":134,"threads":135,"compute_num_jobs":136,"num_jobs":137,"either":138,"value":139,"max_jobs":140,"environment":141,"variable":142,"defined":143,"cpus":144,"info":145,"using":146,"else":147,"sched_getaffinity":148,"isn":149,"universally":150,"fall":151,"back":152,"cpu_count":153,"we":154,"get":155,"error":156,"here":157,"len":158,"attributeerror":159,"nvcc_threads":160,"_is_cuda":161,"get_nvcc_cuda_version":162,"11":163,"when":164,"reduce":165,"avoid":166,"overloading":167,"system":168,"max":169,"perform":170,"cmake":171,"configuration":172,"single":173,"configure":174,"ext":175,"ve":176,"already":177,"cmakelists":178,"txt":179,"exit":180,"early":181,"select":182,"build":183,"type":184,"note":185,"optimization":186,"level":187,"debug":188,"default_cfg":189,"relwithdebinfo":190,"cfg":191,"cmake_build_type":192,"cmake_args":193,"dcmake_build_type":194,"format":195,"dvllm_target_device":196,"verbose":197,"dcmake_verbose_makefile":198,"dcmake_c_compiler_launcher":199,"dcmake_cxx_compiler_launcher":200,"dcmake_cuda_compiler_launcher":201,"dcmake_hip_compiler_launcher":202,"pass":203,"python":204,"executable":205,"can":206,"find":207,"exact":208,"match":209,"dvllm_python_executable":210,"reuse":211,"dependencies":212,"subsequent":213,"calls":214,"dvllm_python_path":215,"override":216,"base":217,"directory":218,"fetchcontent":219,"downloads":220,"root":221,"deps":222,"allows":223,"sharing":224,"between":225,"profiles":226,"plays":227,"more":228,"nicely":229,"fetchcontent_base_dir":230,"fc_base_dir":231,"environ":232,"dfetchcontent_base_dir":233,"parallelism":234,"tool":235,"dnvcc_threads":236,"build_tool":237,"dcmake_job_pool_compile":238,"string":239,"dcmake_job_pools":240,"default":241,"whatever":242,"picks":243,"make":244,"sure":245,"use":246,"dcmake_cuda_compiler":247,"bin":248,"check_call":249,"cwd":250,"build_temp":251,"build_extensions":252,"ensure":253,"present":254,"working":255,"check_output":256,"oserror":257,"raise":258,"runtimeerror":259,"create":260,"does":261,"exist":262,"exists":263,"makedirs":264,"targets":265,"target_name":266,"removeprefix":267,"vllm_flash_attn":268,"all":269,"extensions":270,"append":271,"build_args":272,"target":273,"install":274,"libraries":275,"proper":276,"location":277,"outdir":278,"get_ext_fullpath":279,"absolute":280,"skip":281,"same":282,"continue":283,"appends":284,"prefix":285,"contains":286,"need":287,"remove":288,"range":289,"count":290,"should":291,"actually":292,"components":293,"install_args":294,"component":295,"first":296,"standard":297,"copy":298,"build_lib":299,"current":300,"included":301,"editable":302,"glob":303,"files":304,"recursive":305,"file":306,"dst_file":307,"split":308,"print":309,"copying":310,"dirname":311,"exist_ok":312,"copy_file":313,"precompiled_build_ext":314,"disables":315,"precompiled":316,"binaries":317,"assert":318,"vllm_use_precompiled":319,"supported":320,"builds":321,"skipping":322,"precompiled_wheel_utils":323,"extracts":324,"other":325,"existing":326,"wheel":327,"staticmethod":328,"extract_precompiled_and_patch_package":329,"wheel_url_or_path":330,"tempfile":331,"zipfile":332,"temp_dir":333,"isfile":334,"wheel_filename":335,"mkdtemp":336,"wheels":337,"wheel_path":338,"downloading":339,"urlretrieve":340,"filename":341,"package_data_patch":342,"files_to_copy":343,"_c":344,"abi3":345,"_moe_c":346,"_flashmla_c":347,"_vllm_fa2_c":348,"_vllm_fa3_c":349,"cumem_allocator":350,"compiled_regex":351,"file_members":352,"list":353,"filter":354,"lambda":355,"filelist":356,"extract":357,"target_path":358,"open":359,"src":360,"wb":361,"dst":362,"copyfileobj":363,"pkg":364,"replace":365,"setdefault":366,"basename":367,"finally":368,"removing":369,"temporary":370,"rmtree":371,"get_base_commit_in_main_branch":372,"force":373,"nightly":374,"mainly":375,"used":376,"ci":377,"testing":378,"vllm_test_use_precompiled_nightly_wheel":379,"latest":380,"commit":381,"hash":382,"upstream":383,"main":384,"branch":385,"resp_json":386,"curl":387,"https":388,"api":389,"github":390,"com":391,"repos":392,"project":393,"commits":394,"decode":395,"utf":396,"upstream_main_commit":397,"loads":398,"sha":399,"docker":400,"context":401,"git":402,"immutable":403,"missing":404,"vllm_docker_build_context":405,"check":406,"local":407,"repo":408,"cat":409,"calledprocesserror":410,"fetch":411,"remote":412,"repository":413,"update":414,"any":415,"branches":416,"ensures":417,"ref":418,"its":419,"history":420,"our":421,"current_branch":422,"show":423,"strip":424,"base_commit":425,"merge":426,"valueerror":427,"err":428,"failed":429,"compatible":430,"your":431,"dev":432,"_no_device":433,"has_cuda":434,"_is_neuron":435,"_is_tpu":436,"_is_hip":437,"rocm":438,"neuron":439,"tpu":440,"_is_cpu":441,"_is_xpu":442,"xpu":443,"_build_custom_ops":444,"get_rocm_version":445,"librocm":446,"core":447,"see":448,"blob":449,"d11f5c20d500f729c393680a01fa902ebf92094b":450,"rocm_version":451,"cpp":452,"l21":453,"librocm_core_file":454,"lib":455,"is_file":456,"librocm_core":457,"cdll":458,"vererrors":459,"c_uint32":460,"get_rocm_core_version":461,"getrocmversion":462,"restype":463,"argtypes":464,"pointer":465,"major":466,"minor":467,"patch":468,"byref":469,"get_neuronxcc_version":470,"sysconfig":471,"site_dir":472,"get_paths":473,"purelib":474,"version_file":475,"neuronxcc":476,"executed":477,"successfully":478,"fp":479,"content":480,"read":481,"regular":482,"expression":483,"search":484,"__version__":485,"group":486,"could":487,"output":488,"adapted":489,"nvidia":490,"apex":491,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":492,"nvcc_output":493,"universal_newlines":494,"release_idx":495,"index":496,"release":497,"nvcc_cuda_version":498,"get_gaudi_sw_version":499,"returns":500,"driver":501,"enable":502,"console":503,"printing":504,"hl":505,"smi":506,"shell":507,"text":508,"capture_output":509,"env":510,"enable_console":511,"returncode":512,"stdout":513,"get_vllm_version":514,"write_to":515,"_version":516,"sep":517,"versions":518,"might":519,"contain":520,"cuda_version":521,"cuda_version_str":522,"source":523,"tarball":524,"required":525,"pypi":526,"sdist":527,"argv":528,"cu":529,"neuron_version":530,"neuron_version_str":531,"unknown":532,"runtime":533,"get_requirements":534,"package":535,"requirements":536,"requirements_dir":537,"_read_requirements":538,"resolved_requirements":539,"line":540,"common":541,"cuda_major":542,"cuda_minor":543,"modified_requirements":544,"req":545,"flash":546,"attn":547,"built":548,"unsupported":549,"please":550,"ext_modules":551,"_rocm_c":552,"fa3":553,"requires":554,"later":555,"optional":556,"since":557,"doesn":558,"produce":559,"targeting":560,"hopper":561,"package_data":562,"typed":563,"model_executor":564,"layers":565,"fused_moe":566,"configs":567,"quantization":568,"wheel_location":569,"vllm_precompiled_wheel_location":570,"wheel_url":571,"ai":572,"cp38":573,"manylinux1_x86_64":574,"whl":575,"resp":576,"warn":577,"falling":578,"items":579,"extend":580,"cmdclass":581,"static":582,"metadata":583,"rather":584,"go":585,"pyproject":586,"toml":587,"install_requires":588,"extras_require":589,"bench":590,"pandas":591,"datasets":592,"tensorizer":593,"10":594,"fastsafetensors":595,"runai":596,"model":597,"streamer":598,"13":599,"s3":600,"boto3":601,"audio":602,"librosa":603,"soundfile":604,"mistral_common":605,"processing":606,"video":607,"kept":608,"backwards":609,"compatibility":610,"flashinfer":611,"updated":612,"together":613,"dockerfile":614,"security":615,"policy":616,"reporting":617,"issues":618,"report":619,"privately":620,"vulnerability":621,"submission":622,"form":623,"advisories":624,"new":625,"issue":626,"triage":627,"reports":628,"triaged":629,"management":630,"team":631,"docs":632,"en":633,"contributing":634,"vulnerability_management":635,"html":636,"threat":637,"guide":638,"documentation":639,"usage":640,"information":641,"assumptions":642,"recommendations":643,"pytorch":644,"md":645,"how":646,"securely":647,"interact":648,"models":649,"severity":650,"risk":651,"each":652,"taking":653,"account":654,"experience":655,"dealing":656,"past":657,"affected":658,"defaults":659,"cases":660,"following":661,"categories":662,"critical":663,"vulnerabilities":664,"allow":665,"attackers":666,"execute":667,"arbitrary":668,"code":669,"take":670,"full":671,"control":672,"significantly":673,"compromise":674,"confidentiality":675,"integrity":676,"availability":677,"without":678,"interaction":679,"privileges":680,"needed":681,"examples":682,"include":683,"execution":684,"via":685,"network":686,"deserialization":687,"exploit":688,"chains":689,"generally":690,"those":691,"rated":692,"cvss":693,"high":694,"serious":695,"flaws":696,"elevated":697,"impact":698,"like":699,"rce":700,"specific":701,"limited":702,"contexts":703,"significant":704,"data":705,"loss":706,"require":707,"advanced":708,"conditions":709,"some":710,"trust":711,"deployment":712,"modes":713,"multi":714,"node":715,"where":716,"sort":717,"privileged":718,"access":719,"typically":720,"scores":721,"moderate":722,"cause":723,"denial":724,"service":725,"partial":726,"disruption":727,"do":728,"breach":729,"rating":730,"low":731,"informational":732,"disclosures":733,"errors":734,"non":735,"exploitable":736,"weaknesses":737,"privilege":738,"offer":739,"negligible":740,"side":741,"channel":742,"attacks":743,"collisions":744,"often":745,"less":746,"than":747,"prenotification":748,"certain":749,"prenotify":750,"organizations":751,"vendors":752,"ship":753,"purpose":754,"coordinated":755,"fixes":756,"severe":757,"private":758,"email":759,"notification":760,"also":761,"adding":762,"contacts":763,"advisory":764,"few":765,"days":766,"before":767,"you":768,"wish":769,"added":770,"send":771,"members":772,"vendor":773,"contact":774,"analyzed":775,"case":776,"basis":777,"withdraw":778,"receiving":779,"future":780,"prenotifications":781,"about":782,"public":783,"membership":784,"change":785,"based":786,"refinements":787,"who":788,"requires_files":789,"cleaning":790,"lines":791,"readlines":792,"lower":793,"removed":794,"write":795,"done":796,"releasing":797,"releases":798,"reliable":799,"packaged":800,"binary":801,"conveniently":802,"accessed":803,"serve":804,"key":805,"milestones":806,"development":807,"communicate":808,"community":809,"newly":810,"features":811,"improvements":812,"upcoming":813,"changes":814,"affect":815,"users":816,"potential":817,"breaking":818,"versioning":819,"uses":820,"right":821,"shifted":822,"scheme":823,"out":824,"every":825,"weeks":826,"bug":827,"opposed":828,"semver":829,"made":830,"special":831,"post1":832,"released":833,"_major_":834,"architectural":835,"milestone":836,"incompatible":837,"similar":838,"_minor_":839,"_patch_":840,"_post1_":841,"_patch":842,"1_":843,"explicit":844,"implicit":845,"post":846,"cadence":847,"bi":848,"weekly":849,"after":850,"year":851,"2025":852,"dates":853,"below":854,"tentative":855,"date":856,"jan":857,"feb":858,"mar":859,"apr":860,"jun":861,"jul":862,"aug":863,"14":864,"15":865,"16":866,"17":867,"oct":868,"18":869,"19":870,"nov":871,"20":872,"21":873,"dec":874,"22":875,"23":876,"dedicated":877,"cut":878,"performed":879,"live":880,"previously":881,"reused":882,"triggered":883,"push":884,"rc":885,"tag":886,"vx":887,"rc1":888,"enables":889,"us":890,"test":891,"multiple":892,"rcs":893,"final":894,"trigger":895,"notes":896,"assets":897,"created":898,"monitor":899,"reverts":900,"apply":901,"cherry":902,"pick":903,"criteria":904,"approach":905,"finalizing":906,"clear":907,"what":908,"allowed":909,"process":910,"land":911,"pr":912,"has":913,"sufficient":914,"time":915,"complete":916,"thorough":917,"round":918,"stable":919,"regression":920,"address":921,"functional":922,"performance":923,"against":924,"most":925,"recent":926,"silent":927,"incorrectness":928,"crashes":929,"deadlocks":930,"large":931,"memory":932,"leaks":933,"introduced":934,"identifiers":935,"feature":936,"work":937,"prs":938,"considered":939,"merged":940,"trunk":941,"manual":942,"validations":943,"e2e":944,"validation":945,"end":946,"regressions":947,"benchmark":948,"workflow":949,"integration":950,"actions":951,"workflows":952,"yml":953,"coverage":954,"llama3":955,"llama4":956,"mixtral":957,"hardware":958,"h100":959,"amd":960,"mi300x":961,"_note":962,"availability_":963,"step":964,"review":965,"familiarize":966,"yourself":967,"configurations":968,"tree":969,"benchmarks":970,"navigate":971,"v0":972,"results":973,"once":974,"completes":975,"dashboard":976,"hud":977,"org":978,"llms":979,"reponame":980,"2fvllm":981,"under":982,"corresponding":983,"comparison":984,"compare":985,"previous":986,"verify":987,"occurred":988,"example":989,"vs":990,"starttime":991,"thu":992,"2c":993,"2017":994,"20apr":995,"202025":996,"2021":997,"3a43":998,"3a50":999,"20gmt":1000,"stoptime":1001,"wed":1002,"2016":1003,"20jul":1004,"granularity":1005,"week":1006,"lbranch":1007,"lcommit":1008,"b6553be1bc75f046b00046a4ad7576364d03c835":1009,"rbranch":1010,"rcommit":1011,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1012,"benchmarkname":1013,"modelname":1014,"20models":1015,"backendname":1016,"20backends":1017,"modename":1018,"20modes":1019,"dtypename":1020,"20dtype":1021,"devicename":1022,"20devices":1023,"archname":1024,"20platforms":1025,"cmake_minimum_required":1026,"26":1027,"places":1028,"correct":1029,"mkdir":1030,"cd":1031,"python3":1032,"dcmake_install_prefix":1033,"want":1034,"one":1035,"manually":1036,"vllm_extensions":1037,"languages":1038,"cxx":1039,"overridden":1040,"cache":1041,"device":1042,"backend":1043,"message":1044,"cmake_current_list_dir":1045,"suppress":1046,"warnings":1047,"unused":1048,"specified":1049,"variables":1050,"ignoreme":1051,"vllm_python_path":1052,"prevent":1053,"installation":1054,"cutlass":1055,"cmake_install_local_only":1056,"all_components":1057,"searched":1058,"order":1059,"selected":1060,"sync":1061,"python_supported_versions":1062,"gpu":1063,"architectures":1064,"hip_supported_archs":1065,"gfx906":1066,"gfx908":1067,"gfx90a":1068,"gfx942":1069,"gfx950":1070,"gfx1030":1071,"gfx1100":1072,"gfx1101":1073,"gfx1200":1074,"gfx1201":1075,"expected":1076,"currently":1077,"having":1078,"incorrect":1079,"derived":1080,"various":1081,"consistent":1082,"torch_supported_version_cuda":1083,"torch_supported_version_rocm":1084,"exactly":1085,"matches":1086,"vllm_python_executable":1087,"find_python_from_executable":1088,"fatal_error":1089,"desired":1090,"running":1091,"endif":1092,"cmake_prefix_path":1093,"append_cmake_prefix_path":1094,"find_program":1095,"nvcc_executable":1096,"cuda_found":1097,"found":1098,"imports":1099,"partially":1100,"customizations":1101,"explicitly":1102,"check_language":1103,"enable_language":1104,"etc":1105,"find_package":1106,"must":1107,"happen":1108,"cmake_cuda_compiler_version":1109,"gets":1110,"version_greater_equal":1111,"cuda_supported_archs":1112,"forward":1113,"external":1114,"scripts":1115,"strequal":1116,"cpu_extension":1117,"up":1118,"language":1119,"hip_found":1120,"vllm_gpu_lang":1121,"torch_version":1122,"version_equal":1123,"saw":1124,"instead":1125,"elseif":1126,"importing":1127,"recognizes":1128,"sets":1129,"let":1130,"recognize":1131,"understand":1132,"enabled":1133,"rocm_version_dev_major":1134,"greater_equal":1135,"per":1136,"down":1137,"cmake_cuda_flags":1138,"applied":1139,"globally":1140,"clear_cuda_arches":1141,"cuda_arch_flags":1142,"extract_unique_cuda_archs_ascending":1143,"cuda_archs":1144,"archs":1145,"cuda_archs_loose_intersection":1146,"detected":1147,"them":1148,"arches":1149,"stored":1150,"vllm_gpu_arches":1151,"override_gpu_arches":1152,"_supported_archs":1153,"query":1154,"additional":1155,"flags":1156,"given":1157,"vllm_gpu_flags":1158,"get_torch_gpu_compiler_flags":1159,"compiled":1160,"part":1161,"play":1162,"dependency":1163,"produces":1164,"artifacts":1165,"binary_dir":1166,"conflicts":1167,"types":1168,"cmake_binary_dir":1169,"make_directory":1170,"overriding":1171,"ggdb3":1172,"devug":1173,"cmake_":1174,"_flags_debug":1175,"o0":1176,"cmake_cxx_flags_debug":1177,"functions":1178,"marked":1179,"nodiscard":1180,"ignores":1181,"result":1182,"generates":1183,"lot":1184,"always":1185,"mask":1186,"real":1187,"suppressing":1188,"until":1189,"properly":1190,"addressed":1191,"_flags":1192,"wno":1193,"cmake_cxx_flags":1194,"define":1195,"vllm_cumem_ext_src":1196,"csrc":1197,"set_gencode_flags_for_srcs":1198,"srcs":1199,"enabling":1200,"cumem":1201,"allocator":1202,"link":1203,"library":1204,"cumem_libs":1205,"cuda_driver":1206,"define_gpu_extension_target":1207,"destination":1208,"use_sabi":1209,"with_soabi":1210,"vllm_ext_src":1211,"mamba":1212,"mamba_ssm":1213,"selective_scan_fwd":1214,"cache_kernels":1215,"attention":1216,"paged_attention_v1":1217,"paged_attention_v2":1218,"merge_attn_states":1219,"vertical_slash_index":1220,"pos_encoding_kernels":1221,"activation_kernels":1222,"layernorm_kernels":1223,"layernorm_quant_kernels":1224,"sampler":1225,"cuda_view":1226,"gptq":1227,"q_gemm":1228,"compressed_tensors":1229,"int8_quant_kernels":1230,"fp8":1231,"fused_kernels":1232,"fused_layernorm_dynamic_per_token_quant":1233,"gguf":1234,"gguf_kernel":1235,"cuda_utils_kernels":1236,"custom_all_reduce":1237,"torch_bindings":1238,"cutlass_enable_headers_only":1239,"header":1240,"cutlass_revision":1241,"bogus":1242,"messages":1243,"v4":1244,"revision":1245,"vllm_cutlass_src_dir":1246,"provided":1247,"is_absolute":1248,"get_filename_component":1249,"fetchcontent_declare":1250,"source_dir":1251,"git_repository":1252,"keep":1253,"above":1254,"git_tag":1255,"git_progress":1256,"speed":1257,"download":1258,"retrieving":1259,"important":1260,"git_shallow":1261,"works":1262,"names":1263,"tags":1264,"fetchcontent_makeavailable":1265,"awq":1266,"gemm_kernels":1267,"permute_cols":1268,"cutlass_w8a8":1269,"scaled_mm_entry":1270,"fp4":1271,"nvfp4_quant_entry":1272,"nvfp4_scaled_mm_entry":1273,"nvfp4_blockwise_moe_kernel":1274,"sparse":1275,"sparse_scaled_mm_entry":1276,"cutlass_extensions":1277,"mla":1278,"cutlass_mla_entry":1279,"per_token_group_quant":1280,"marlin":1281,"kernels":1282,"least":1283,"sizes":1284,"shapes":1285,"machete":1286,"bf16":1287,"atomicadd":1288,"ptx":1289,"marlin_archs":1290,"generate":1291,"preselected":1292,"input":1293,"pairs":1294,"schedules":1295,"marlin_gen_script":1296,"cmake_current_source_dir":1297,"gptq_marlin":1298,"generate_kernels":1299,"md5":1300,"marlin_gen_script_hash":1301,"generation":1302,"script":1303,"last":1304,"execute_process":1305,"cmake_command":1306,"pythonpath":1307,"python_executable":1308,"result_variable":1309,"marlin_generation_result":1310,"output_variable":1311,"output_file":1312,"cmake_current_binary_dir":1313,"marlin_generation":1314,"log":1315,"error_file":1316,"equal":1317,"ncheck":1318,"details":1319,"completed":1320,"changed":1321,"marlin_template_kernel_src":1322,"kernel_":1323,"set_source_files_properties":1324,"properties":1325,"compile_flags":1326,"global":1327,"template":1328,"stub":1329,"marlin_srcs":1330,"dense":1331,"marlin_cuda_kernel":1332,"marlin_24_cuda_kernel":1333,"qqq":1334,"marlin_qqq_gemm_kernel":1335,"gptq_marlin_repack":1336,"awq_marlin_repack":1337,"allspark":1338,"allspark_archs":1339,"allspark_srcs":1340,"gptq_allspark":1341,"allspark_repack":1342,"allspark_qgemm_w8a16":1343,"scaled_mm_3x_archs":1344,"cutlass_scaled_mm":1345,"c3x":1346,"scaled_mm_archs":1347,"0a":1348,"scaled_mm_c3x_sm90":1349,"scaled_mm_sm90_fp8":1350,"scaled_mm_sm90_int8":1351,"scaled_mm_azp_sm90_int8":1352,"scaled_mm_blockwise_sm90_fp8":1353,"denable_scaled_mm_sm90":1354,"scaled_mm_c2x":1355,"know":1356,"compiler":1357,"recommend":1358,"upgrading":1359,"intend":1360,"quantized":1361,"geforce":1362,"blackwell":1363,"sm120":1364,"scaled_mm_c3x_sm120":1365,"scaled_mm_sm120_fp8":1366,"scaled_mm_blockwise_sm120_fp8":1367,"denable_scaled_mm_sm120":1368,"scaled_mm_c3x_120":1369,"sm100":1370,"1a":1371,"scaled_mm_c3x_sm100":1372,"scaled_mm_sm100_fp8":1373,"scaled_mm_blockwise_sm100_fp8":1374,"denable_scaled_mm_sm100":1375,"scaled_mm_c3x_100":1376,"c2x":1377,"remaining":1378,"3x":1379,"scaled_mm_2x_archs":1380,"subtract":1381,"remove_item":1382,"denable_scaled_mm_c2x":1383,"covered":1384,"scaled_mm_c3x":1385,"cutlass_scaled_sparse_mm":1386,"cutlass_compressor":1387,"sparse_scaled_mm_c3x":1388,"denable_sparse_scaled_mm_c3x":1389,"nvfp4_scaled_mm_sm120":1390,"fp4_archs":1391,"nvfp4_quant_kernels":1392,"nvfp4_scaled_mm_sm120_kernels":1393,"denable_nvfp4_sm120":1394,"nvfp4":1395,"were":1396,"nvfp4_experts_quant":1397,"nvfp4_scaled_mm_kernels":1398,"denable_nvfp4_sm100":1399,"denable_cutlass_moe_sm100":1400,"mla_archs":1401,"cutlass_mla_kernels":1402,"sm100_cutlass_mla_kernel":1403,"denable_cutlass_mla":1404,"add":1405,"include_directories":1406,"cutlass_dir":1407,"77_blackwell_fmha":1408,"moe":1409,"kernel":1410,"cutlass_moe_mm":1411,"get_cutlass_":1412,"pplx_":1413,"moe_mm_data":1414,"possible":1415,"grouped_mm_c3x_sm90":1416,"denable_cutlass_moe_sm90":1417,"grouped_mm_c3x":1418,"grouped_mm_c3x_sm100":1419,"moe_data":1420,"cutlass_moe_data_archs":1421,"blockwise_scaled_group_mm_sm100":1422,"something":1423,"sm90a":1424,"machete_archs":1425,"machete_gen_script":1426,"machete_gen_script_hash":1427,"machete_generation_result":1428,"machete_generation_output":1429,"machete_generation":1430,"generated":1431,"machete_gen_sources":1432,"machete_pytorch":1433,"w4a16":1434,"quickreduce":1435,"custom_quickreduce":1436,"cutlass_include_dir":1437,"cutlass_tools_util_include_dir":1438,"cudagetdriverentrypointbyversion":1439,"wrapper":1440,"calling":1441,"causes":1442,"problems":1443,"linking":1444,"earlier":1445,"setting":1446,"sidesteps":1447,"target_compile_definitions":1448,"cutlass_enable_direct_cuda_driver_call":1449,"vllm_moe_ext_src":1450,"moe_align_sum_kernels":1451,"topk_softmax_kernels":1452,"moe_wna16":1453,"moe_permute_src":1454,"permute_unpermute_kernels":1455,"moe_permute_unpermute_kernel":1456,"moe_permute_unpermute_op":1457,"vllm_moe_wna16_src":1458,"marlin_moe_archs":1459,"moe_marlin_gen_script":1460,"marlin_moe_wna16":1461,"moe_marlin_gen_script_hash":1462,"moe_marlin_generation_result":1463,"moe_marlin_generation_output":1464,"moe_marlin_generation":1465,"moe_wnaa16_marlin_src":1466,"vllm_rocm_ext_src":1467,"skinny_gemms":1468,"projects":1469,"external_projects":1470,"flashmla":1471,"overwrites":1472,"markdownlint":1473,"disable":1474,"md001":1475,"md041":1476,"align":1477,"center":1478,"picture":1479,"media":1480,"prefers":1481,"color":1482,"dark":1483,"srcset":1484,"raw":1485,"githubusercontent":1486,"logos":1487,"logo":1488,"png":1489,"img":1490,"alt":1491,"light":1492,"width":1493,"55":1494,"h3":1495,"easy":1496,"fast":1497,"cheap":1498,"llm":1499,"serving":1500,"everyone":1501,"href":1502,"blog":1503,"arxiv":1504,"abs":1505,"2309":1506,"06180":1507,"paper":1508,"vllm_project":1509,"twitter":1510,"discuss":1511,"user":1512,"forum":1513,"slack":1514,"developer":1515,"news":1516,"08":1517,"hosted":1518,"beijing":1519,"meetup":1520,"mp":1521,"weixin":1522,"qq":1523,"dgkwg1wfpwgo2jcdtqqhxa":1524,"focusing":1525,"scale":1526,"slides":1527,"drive":1528,"google":1529,"folders":1530,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":1531,"recording":1532,"www":1533,"chaspark":1534,"1166916873711665152":1535,"05":1536,"nyc":1537,"lu":1538,"ma":1539,"c1rqyf1f":1540,"presentation":1541,"1_q_aw_iomjwuimf1s1ym":1542,"zhjxz8cuel0ijvaquoybea":1543,"edit":1544,"usp":1545,"now":1546,"foundation":1547,"announcement":1548,"welcomes":1549,"01":1550,"excited":1551,"announce":1552,"alpha":1553,"v1":1554,"upgrade":1555,"7x":1556,"speedup":1557,"clean":1558,"optimized":1559,"loop":1560,"zero":1561,"overhead":1562,"caching":1563,"enhanced":1564,"multimodal":1565,"support":1566,"27":1567,"summary":1568,"04":1569,"asia":1570,"day":1571,"sginnovate":1572,"event":1573,"morning":1574,"evening":1575,"slots":1576,"inaugural":1577,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":1578,"03":1579,"ollama":1580,"inference":1581,"night":1582,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":1583,"china":1584,"n77gibl2coratqhtveazfg":1585,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":1586,"east":1587,"coast":1588,"7mu4k4xx":1589,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":1590,"slide":1591,"id":1592,"g31441846c39_0_0":1593,"02":1594,"ninth":1595,"h7g3kuj9":1596,"meta":1597,"1jzc_pzvxrvnsfvcw":1598,"v4cfxb6pn7zz2cyp_flwo05aqg":1599,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":1600,"view":1601,"posted":1602,"eighth":1603,"zep56hui":1604,"cloud":1605,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":1606,"1h24phewanyrl11xy5dxubvrc9f9kkjix":1607,"2024":1608,"joins":1609,"ecosystem":1610,"seventh":1611,"h0qvrajz":1612,"snowflake":1613,"1e3cxqbv3jsfgp30swyvs3em_tw":1614,"ghohj9pajgk6kr54":1615,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":1616,"just":1617,"coordinating":1618,"contributions":1619,"discussing":1620,"feel":1621,"free":1622,"ray":1623,"summit":1624,"held":1625,"track":1626,"opening":1627,"talk":1628,"1b_kqxphbtra_mdf":1629,"tr6i8rwdou5qotznceg2mkzxehm":1630,"learn":1631,"talks":1632,"youtube":1633,"playlist":1634,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":1635,"contributors":1636,"09":1637,"sixth":1638,"87q3nvnh":1639,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":1640,"9wqyp7ny93xrs":1641,"07":1642,"fifth":1643,"lp0gyjqr":1644,"aws":1645,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":1646,"partnership":1647,"officially":1648,"llama":1649,"pipeline":1650,"llama31":1651,"06":1652,"fourth":1653,"agivllm":1654,"cloudflare":1655,"bentoml":1656,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":1657,"third":1658,"robloxandvllmmeetup2024":1659,"splashthat":1660,"roblox":1661,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":1662,"second":1663,"ygxbpzhl":1664,"ibm":1665,"12mi2skabnuw5rbwxdyy":1666,"hthth4imsnceoq10jdqbxga":1667,"2023":1668,"a16z":1669,"1ql":1670,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":1671,"would":1672,"express":1673,"sincere":1674,"gratitude":1675,"andreessen":1676,"horowitz":1677,"30":1678,"supporting":1679,"providing":1680,"generous":1681,"grant":1682,"research":1683,"fastchat":1684,"powered":1685,"lmsys":1686,"vicuna":1687,"chatbot":1688,"arena":1689,"chat":1690,"mid":1691,"april":1692,"originally":1693,"developed":1694,"sky":1695,"computing":1696,"lab":1697,"cs":1698,"berkeley":1699,"edu":1700,"uc":1701,"evolved":1702,"driven":1703,"both":1704,"academia":1705,"industry":1706,"state":1707,"art":1708,"throughput":1709,"efficient":1710,"pagedattention":1711,"continuous":1712,"batching":1713,"incoming":1714,"requests":1715,"graph":1716,"quantizations":1717,"2210":1718,"17323":1719,"2306":1720,"00978":1721,"autoround":1722,"05516":1723,"int4":1724,"int8":1725,"flashattention":1726,"speculative":1727,"decoding":1728,"chunked":1729,"prefill":1730,"flexible":1731,"seamless":1732,"popular":1733,"hugging":1734,"face":1735,"algorithms":1736,"parallel":1737,"sampling":1738,"beam":1739,"tensor":1740,"expert":1741,"distributed":1742,"streaming":1743,"outputs":1744,"openai":1745,"server":1746,"gpus":1747,"intel":1748,"powerpc":1749,"lora":1750,"seamlessly":1751,"huggingface":1752,"transformer":1753,"mixture":1754,"deepseek":1755,"v2":1756,"v3":1757,"embedding":1758,"e5":1759,"mistral":1760,"modal":1761,"llava":1762,"supported_models":1763,"getting":1764,"started":1765,"pip":1766,"getting_started":1767,"bash":1768,"visit":1769,"quickstart":1770,"welcome":1771,"collaborations":1772,"involved":1773,"sponsors":1774,"compute":1775,"resources":1776,"thank":1777,"alphabetical":1778,"cash":1779,"donations":1780,"dropbox":1781,"sequoia":1782,"capital":1783,"skywork":1784,"zhenfund":1785,"alibaba":1786,"anyscale":1787,"crusoe":1788,"databricks":1789,"deepinfra":1790,"nebius":1791,"novita":1792,"replicate":1793,"runpod":1794,"trainy":1795,"san":1796,"diego":1797,"sponsor":1798,"official":1799,"fundraising":1800,"venue":1801,"through":1802,"opencollective":1803,"plan":1804,"fund":1805,"maintenance":1806,"adoption":1807,"citation":1808,"cite":1809,"bibtex":1810,"inproceedings":1811,"kwon2023efficient":1812,"title":1813,"author":1814,"woosuk":1815,"kwon":1816,"zhuohan":1817,"li":1818,"siyuan":1819,"zhuang":1820,"ying":1821,"sheng":1822,"lianmin":1823,"zheng":1824,"cody":1825,"hao":1826,"yu":1827,"joseph":1828,"gonzalez":1829,"zhang":1830,"ion":1831,"stoica":1832,"booktitle":1833,"proceedings":1834,"acm":1835,"sigops":1836,"29th":1837,"symposium":1838,"operating":1839,"systems":1840,"principles":1841,"start":1842,"technical":1843,"questions":1844,"fellow":1845,"partnerships":1846,"lists":1847,"mailto":1848,"kit":1849,"refer":1850,"conduct":1851,"pledge":1852,"leaders":1853,"participation":1854,"harassment":1855,"regardless":1856,"age":1857,"body":1858,"size":1859,"visible":1860,"invisible":1861,"disability":1862,"ethnicity":1863,"sex":1864,"characteristics":1865,"gender":1866,"identity":1867,"education":1868,"socioeconomic":1869,"nationality":1870,"personal":1871,"appearance":1872,"race":1873,"caste":1874,"religion":1875,"sexual":1876,"orientation":1877,"act":1878,"ways":1879,"contribute":1880,"welcoming":1881,"diverse":1882,"inclusive":1883,"healthy":1884,"standards":1885,"behavior":1886,"contributes":1887,"positive":1888,"demonstrating":1889,"empathy":1890,"kindness":1891,"toward":1892,"people":1893,"being":1894,"respectful":1895,"differing":1896,"opinions":1897,"viewpoints":1898,"experiences":1899,"giving":1900,"gracefully":1901,"accepting":1902,"constructive":1903,"feedback":1904,"responsibility":1905,"apologizing":1906,"mistakes":1907,"learning":1908,"best":1909,"individuals":1910,"overall":1911,"unacceptable":1912,"sexualized":1913,"imagery":1914,"advances":1915,"kind":1916,"trolling":1917,"insulting":1918,"derogatory":1919,"comments":1920,"political":1921,"publishing":1922,"others":1923,"physical":1924,"permission":1925,"reasonably":1926,"inappropriate":1927,"professional":1928,"enforcement":1929,"responsibilities":1930,"responsible":1931,"clarifying":1932,"enforcing":1933,"acceptable":1934,"appropriate":1935,"fair":1936,"corrective":1937,"action":1938,"response":1939,"deem":1940,"threatening":1941,"offensive":1942,"harmful":1943,"reject":1944,"wiki":1945,"edits":1946,"aligned":1947,"reasons":1948,"moderation":1949,"decisions":1950,"scope":1951,"applies":1952,"within":1953,"spaces":1954,"individual":1955,"representing":1956,"posting":1957,"social":1958,"acting":1959,"appointed":1960,"representative":1961,"online":1962,"offline":1963,"irl":1964,"instances":1965,"abusive":1966,"harassing":1967,"otherwise":1968,"reported":1969,"complaints":1970,"reviewed":1971,"investigated":1972,"promptly":1973,"fairly":1974,"obligated":1975,"respect":1976,"privacy":1977,"reporter":1978,"incident":1979,"guidelines":1980,"follow":1981,"determining":1982,"consequences":1983,"violation":1984,"correction":1985,"deemed":1986,"unprofessional":1987,"unwelcome":1988,"consequence":1989,"written":1990,"clarity":1991,"around":1992,"nature":1993,"explanation":1994,"why":1995,"apology":1996,"requested":1997,"series":1998,"continued":1999,"unsolicited":2000,"period":2001,"includes":2002,"avoiding":2003,"interactions":2004,"well":2005,"channels":2006,"violating":2007,"terms":2008,"lead":2009,"permanent":2010,"ban":2011,"sustained":2012,"communication":2013,"during":2014,"pattern":2015,"aggression":2016,"disparagement":2017,"classes":2018,"attribution":2019,"contributor":2020,"covenant":2021,"code_of_conduct":2022,"inspired":2023,"mozilla":2024,"ladder":2025,"inclusion":2026,"answers":2027,"faq":2028,"translations":2029,"traceback":2030,"typing":2031,"callable":2032,"unittest":2033,"mock":2034,"find_cuda_init":2035,"fn":2036,"object":2037,"helper":2038,"function":2039,"initialization":2040,"initializes":2041,"prints":2042,"stack":2043,"trace":2044,"happens":2045,"_lazy_init":2046,"nonlocal":2047,"extract_stack":2048,"initialized":2049,"format_list":2050,"__main__":2051,"import_module":2052,"latency":2053,"batch":2054,"argparse":2055,"dataclasses":2056,"numpy":2057,"np":2058,"tqdm":2059,"typing_extensions":2060,"deprecated":2061,"benchmark_utils":2062,"convert_to_pytorch_benchmark_format":2063,"write_to_json":2064,"samplingparams":2065,"engine":2066,"arg_utils":2067,"engineargs":2068,"inputs":2069,"prompttype":2070,"sampling_params":2071,"beamsearchparams":2072,"flexibleargumentparser":2073,"save_to_pytorch_benchmark_format":2074,"args":2075,"namespace":2076,"pt_records":2077,"metrics":2078,"latencies":2079,"extra_info":2080,"avg_latency":2081,"percentiles":2082,"pt_file":2083,"splitext":2084,"output_json":2085,"benchmark_latency":2086,"engine_args":2087,"from_cli_args":2088,"processed":2089,"batches":2090,"asdict":2091,"llm_engine":2092,"model_config":2093,"max_model_len":2094,"input_len":2095,"output_len":2096,"greater":2097,"sum":2098,"temperature":2099,"top_p":2100,"ignore_eos":2101,"max_tokens":2102,"detokenize":2103,"disable_detokenize":2104,"dummy_prompt_token_ids":2105,"random":2106,"randint":2107,"10000":2108,"batch_size":2109,"dummy_prompts":2110,"prompt_token_ids":2111,"tolist":2112,"llm_generate":2113,"use_beam_search":2114,"use_tqdm":2115,"beam_search":2116,"beam_width":2117,"run_to_completion":2118,"profile_dir":2119,"start_profile":2120,"stop_profile":2121,"start_time":2122,"perf_counter":2123,"end_time":2124,"warming":2125,"num_iters_warmup":2126,"desc":2127,"warmup":2128,"iterations":2129,"profile":2130,"vllm_torch_profiler_dir":2131,"profiling":2132,"saved":2133,"num_iters":2134,"array":2135,"percentages":2136,"25":2137,"50":2138,"75":2139,"90":2140,"99":2141,"percentile":2142,"avg":2143,"mean":2144,"seconds":2145,"percentage":2146,"zip":2147,"dump":2148,"indent":2149,"create_argument_parser":2150,"parser":2151,"description":2152,"till":2153,"completion":2154,"add_argument":2155,"32":2156,"128":2157,"help":2158,"sequences":2159,"prompt":2160,"store_true":2161,"num":2162,"iters":2163,"save":2164,"responses":2165,"detokenization":2166,"measurement":2167,"add_cli_args":2168,"skews":2169,"numbers":2170,"set_defaults":2171,"enable_prefix_caching":2172,"parse_args":2173,"valid":2174,"profiler":2175,"math":2176,"tracebacktype":2177,"union":2178,"oss":2179,"metric":2180,"record":2181,"integrate":2182,"database":2183,"records":2184,"benchmark_values":2185,"vars":2186,"tp":2187,"tensor_parallel_size":2188,"parameter":2189,"infencoder":2190,"jsonencoder":2191,"clear_inf":2192,"isinstance":2193,"float":2194,"isinf":2195,"inf":2196,"iterencode":2197,"kwargs":2198,"cls":2199,"serializable":2200,"collect":2201,"collector":2202,"timecollector":2203,"total_iteration":2204,"dump_avg_max":2205,"ns":2206,"1000":2207,"ms":2208,"cnt":2209,"_sum":2210,"_max":2211,"monotonic_ns":2212,"__enter__":2213,"__exit__":2214,"exc_type":2215,"baseexception":2216,"exc_value":2217,"exc_traceback":2218,"uvloop":2219,"transformers":2220,"automodelforcausallm":2221,"autotokenizer":2222,"pretrainedtokenizerbase":2223,"benchmark_dataset":2224,"aimodataset":2225,"burstgptdataset":2226,"conversationdataset":2227,"instructcoderdataset":2228,"randomdataset":2229,"samplerequest":2230,"sharegptdataset":2231,"sonnetdataset":2232,"visionarenadataset":2233,"asyncengineargs":2234,"entrypoints":2235,"api_server":2236,"build_async_engine_client_from_engine_args":2237,"textprompt":2238,"tokensprompt":2239,"lorarequest":2240,"requestoutput":2241,"merge_async_iterators":2242,"run_vllm":2243,"tuple":2244,"prompt_len":2245,"expected_output_len":2246,"prompts":2247,"multi_modal_data":2248,"lora_requests":2249,"enable_lora":2250,"lora_request":2251,"beamsearch":2252,"run_vllm_chat":2253,"recommended":2254,"benchmarking":2255,"handles":2256,"formatting":2257,"async":2258,"run_vllm_async":2259,"disable_frontend_multiprocessing":2260,"await":2261,"get_model_config":2262,"generators":2263,"sp":2264,"lr":2265,"enumerate":2266,"generator":2267,"request_id":2268,"all_gens":2269,"res":2270,"run_hf":2271,"tokenizer":2272,"max_batch_size":2273,"trust_remote_code":2274,"from_pretrained":2275,"torch_dtype":2276,"float16":2277,"config":2278,"model_type":2279,"padding":2280,"hf":2281,"pad_token":2282,"eos_token":2283,"pbar":2284,"total":2285,"max_prompt_len":2286,"max_output_len":2287,"next_prompt_len":2288,"next_output_len":2289,"2048":2290,"input_ids":2291,"return_tensors":2292,"pt":2293,"llm_outputs":2294,"do_sample":2295,"num_return_sequences":2296,"use_cache":2297,"max_new_tokens":2298,"batch_decode":2299,"skip_special_tokens":2300,"run_mii":2301,"mii":2302,"client":2303,"tensor_parallel":2304,"terminate_server":2305,"requests_per_second":2306,"tokens_per_second":2307,"elapsed_time":2308,"num_requests":2309,"total_num_tokens":2310,"don":2311,"suffix":2312,"get_requests":2313,"parameters":2314,"dataset":2315,"common_kwargs":2316,"dataset_path":2317,"random_seed":2318,"seed":2319,"sample_kwargs":2320,"lora_path":2321,"max_loras":2322,"num_prompts":2323,"dataset_name":2324,"range_ratio":2325,"random_range_ratio":2326,"prefix_len":2327,"dataset_cls":2328,"sharegpt":2329,"enable_multimodal_chat":2330,"sonnet":2331,"chat_template":2332,"default_chat_template":2333,"return_prompt_formatted":2334,"burstgpt":2335,"no_stream":2336,"supported_dataset_paths":2337,"dataset_subset":2338,"dataset_split":2339,"train":2340,"hf_subset":2341,"hf_split":2342,"values":2343,"sample":2344,"benchmark_throughput":2345,"is_multi_modal":2346,"request_outputs":2347,"async_engine":2348,"hf_max_batch_size":2349,"backends":2350,"tokens":2351,"total_prompt_tokens":2352,"total_output_tokens":2353,"ro":2354,"token_ids":2355,"033":2356,"91mwarning":2357,"0m":2358,"accurate":2359,"image":2360,"counted":2361,"9778":2362,"todo":2363,"token":2364,"length":2365,"counts":2366,"2f":2367,"validate_args":2368,"validate":2369,"arguments":2370,"deprecation":2371,"defaulting":2372,"argument":2373,"next":2374,"stacklevel":2375,"getattr":2376,"valid_backends":2377,"checks":2378,"subset":2379,"ignored":2380,"keys":2381,"needs":2382,"noqa":2383,"e501":2384,"ratio":2385,"settings":2386,"dtype":2387,"auto":2388,"16222":2389,"data_parallel_size":2390,"choices":2391,"stream":2392,"load":2393,"mode":2394,"conversations":2395,"prompt_or_response":2396,"overrides":2397,"maximum":2398,"frontend":2399,"multiprocessing":2400,"decoupled":2401,"adapters":2402,"relative":2403,"identifier":2404,"default_prefix_len":2405,"sampled":2406,"controls":2407,"much":2408,"fixed":2409,"versus":2410,"remains":2411,"approximately":2412,"default_range_ratio":2413,"symmetric":2414,"dtaset":2415,"long":2416,"document":2417,"qa":2418,"workload":2419,"samples":2420,"different":2421,"20000":2422,"replicates":2423,"times":2424,"benchmark_long_document_qa_throughput":2425,"7b":2426,"documents":2427,"repeat":2428,"commandline":2429,"shuffle":2430,"randomly":2431,"tile":2432,"entire":2433,"repeated":2434,"sequence":2435,"potentially":2436,"lowest":2437,"hit":2438,"interleave":2439,"consecutively":2440,"moving":2441,"element":2442,"highest":2443,"meantime":2444,"initialize":2445,"test_long_document_qa":2446,"spent":2447,"generating":2448,"strings":2449,"4f":2450,"secs":2451,"repeat_prompts":2452,"repeat_count":2453,"repetition":2454,"raises":2455,"invalid":2456,"repeated_prompts":2457,"shuffle_seed":2458,"prepare":2459,"beginning":2460,"hi":2461,"document_length":2462,"num_documents":2463,"repeat_mode":2464,"warmup_prompts":2465,"warm":2466,"automatic":2467,"roughly":2468,"excluding":2469,"images":2470,"lengths":2471,"min":2472,"256":2473,"gc":2474,"tabulate":2475,"modelconfig":2476,"speculativeconfig":2477,"vllmconfig":2478,"spec_decode":2479,"ngram_proposer":2480,"ngramproposer":2481,"rows":2482,"max_ngram":2483,"facebook":2484,"opt":2485,"125m":2486,"task":2487,"num_token":2488,"num_spec_token":2489,"tokenizer_mode":2490,"proposer":2491,"vllm_config":2492,"speculative_config":2493,"prompt_lookup_min":2494,"min_ngram":2495,"prompt_lookup_max":2496,"num_speculative_tokens":2497,"method":2498,"ngram":2499,"propose":2500,"num_iteration":2501,"num_req":2502,"headers":2503,"tablefmt":2504,"grid":2505,"floatfmt":2506,"3f":2507,"invoke_main":2508,"gram":2509,"drafting":2510,"iteration":2511,"100":2512,"stablize":2513,"readings":2514,"1500":2515,"minimum":2516,"nargs":2517,"pragma":2518,"cover":2519,"block_pool":2520,"blockpool":2521,"allocate_block":2522,"allocate_blocks":2523,"enforce":2524,"ahead":2525,"minimize":2526,"among":2527,"runs":2528,"num_gpu_blocks":2529,"enable_caching":2530,"get_blocks_times":2531,"free_blocks_times":2532,"blocks":2533,"get_new_blocks":2534,"free_blocks":2535,"nblocks":2536,"allocated":2537,"navg":2538,"nmax":2539,"kv":2540,"100000":2541,"allocate":2542,"500":2543,"commands":2544,"your_model":2545,"swap":2546,"space":2547,"benchmark_serving":2548,"rate":2549,"request_rate":2550,"tgi":2551,"endpoint":2552,"generate_stream":2553,"asyncio":2554,"collections":2555,"abc":2556,"iterable":2557,"dataclass":2558,"datetime":2559,"literal":2560,"backend_request_func":2561,"async_request_funcs":2562,"openai_compatible_backends":2563,"requestfuncinput":2564,"requestfuncoutput":2565,"transformers_utils":2566,"get_tokenizer":2567,"importerror":2568,"argumentparser":2569,"asrdataset":2570,"customdataset":2571,"huggingfacedataset":2572,"mtbenchdataset":2573,"nexteditpredictiondataset":2574,"get_request":2575,"milliseconds_to_seconds_conversion":2576,"benchmarkmetrics":2577,"total_input":2578,"total_output":2579,"request_throughput":2580,"request_goodput":2581,"output_throughput":2582,"total_token_throughput":2583,"mean_ttft_ms":2584,"median_ttft_ms":2585,"std_ttft_ms":2586,"percentiles_ttft_ms":2587,"mean_tpot_ms":2588,"median_tpot_ms":2589,"std_tpot_ms":2590,"percentiles_tpot_ms":2591,"mean_itl_ms":2592,"median_itl_ms":2593,"std_itl_ms":2594,"percentiles_itl_ms":2595,"e2el":2596,"stands":2597,"taken":2598,"sending":2599,"mean_e2el_ms":2600,"median_e2el_ms":2601,"std_e2el_ms":2602,"percentiles_e2el_ms":2603,"calculate_metrics":2604,"input_requests":2605,"dur_s":2606,"selected_percentile_metrics":2607,"selected_percentiles":2608,"goodput_config_dict":2609,"actual_output_lens":2610,"good_completed":2611,"itls":2612,"tpots":2613,"all_tpots":2614,"ttfts":2615,"e2els":2616,"success":2617,"output_tokens":2618,"looking":2619,"itl":2620,"bundled":2621,"inflate":2622,"slightly":2623,"generated_text":2624,"add_special_tokens":2625,"tpot":2626,"latency_minus_ttft":2627,"ttft":2628,"regard":2629,"goodput":2630,"valid_metrics":2631,"slo_values":2632,"req_metric":2633,"is_good_req":2634,"likely":2635,"misconfiguration":2636,"std":2637,"median":2638,"api_url":2639,"base_url":2640,"model_id":2641,"model_name":2642,"logprobs":2643,"burstiness":2644,"disable_tqdm":2645,"max_concurrency":2646,"lora_modules":2647,"extra_body":2648,"ramp_up_strategy":2649,"linear":2650,"exponential":2651,"ramp_up_start_rps":2652,"ramp_up_end_rps":2653,"request_func":2654,"starting":2655,"initial":2656,"test_prompt":2657,"test_prompt_len":2658,"test_output_len":2659,"test_mm_content":2660,"item":2661,"test_input":2662,"multi_modal_content":2663,"test_output":2664,"request_func_input":2665,"choose":2666,"iter":2667,"choice":2668,"profile_input":2669,"profile_output":2670,"distribution":2671,"poisson":2672,"gamma":2673,"traffic":2674,"ramp":2675,"strategy":2676,"increase":2677,"rps":2678,"over":2679,"duration":2680,"factor":2681,"concurrency":2682,"higher":2683,"simplify":2684,"limited_request_func":2685,"semaphore":2686,"contextlib":2687,"nullcontext":2688,"benchmark_start_time":2689,"tasks":2690,"rps_change_events":2691,"last_int_rps":2692,"timestamp":2693,"isoformat":2694,"current_request_rate":2695,"current_int_rps":2696,"rps_val":2697,"mm_content":2698,"req_model_id":2699,"req_model_name":2700,"req_lora_module":2701,"create_task":2702,"gather":2703,"close":2704,"benchmark_duration":2705,"40":2706,"successful":2707,"tok":2708,"total_input_tokens":2709,"input_lens":2710,"output_lens":2711,"generated_texts":2712,"process_one_metric":2713,"metric_attribute_name":2714,"metric_name":2715,"metric_header":2716,"adds":2717,"statistics":2718,"mean_":2719,"_ms":2720,"median_":2721,"std_":2722,"percentiles_":2723,"p_word":2724,"excl":2725,"1st":2726,"inter":2727,"stopping":2728,"stopped":2729,"check_goodput_args":2730,"valid_names":2731,"parse_goodput":2732,"slo_name":2733,"slo_val":2734,"objective":2735,"negative":2736,"slo_pairs":2737,"slo_pair":2738,"argumenttypeerror":2739,"objectives":2740,"specify":2741,"milliseconds":2742,"file_name":2743,"p99_ttft_ms":2744,"p99_tpot_ms":2745,"p99_itl_ms":2746,"useful":2747,"big":2748,"ignored_metrics":2749,"served_model_name":2750,"tokenizer_id":2751,"controlled":2752,"http":2753,"host":2754,"port":2755,"custom":2756,"custom_output_len":2757,"skip_chat_template":2758,"custom_skip_chat_template":2759,"sonnet_input_len":2760,"sonnet_output_len":2761,"sonnet_prefix_len":2762,"implemented":2763,"dataset_class":2764,"supported_datasets":2765,"__subclasses__":2766,"consider":2767,"formats":2768,"is_multimodal":2769,"hf_output_len":2770,"structure":2771,"mapping":2772,"dataset_mapping":2773,"sharegpt_output_len":2774,"random_prefix_len":2775,"random_input_len":2776,"random_output_len":2777,"keyerror":2778,"top_k":2779,"min_p":2780,"greedy":2781,"cache_prompt":2782,"pause":2783,"freeze":2784,"benchmark_result":2785,"percentile_metrics":2786,"metric_percentiles":2787,"save_result":2788,"append_result":2789,"result_json":2790,"current_dt":2791,"strftime":2792,"kvstring":2793,"save_detailed":2794,"fields":2795,"too":2796,"many":2797,"points":2798,"field":2799,"del":2800,"base_model_id":2801,"max_concurrency_str":2802,"qps":2803,"result_filename":2804,"result_dir":2805,"encoding":2806,"outfile":2807,"newline":2808,"tell":2809,"127":2810,"localhost":2811,"ipv4":2812,"8000":2813,"completions":2814,"concurrent":2815,"simulate":2816,"while":2817,"initiated":2818,"means":2819,"combination":2820,"actual":2821,"enough":2822,"unspecified":2823,"disabled":2824,"computed":2825,"dummy":2826,"logprob":2827,"returned":2828,"sent":2829,"synthesize":2830,"arrival":2831,"effect":2832,"follows":2833,"intervals":2834,"bursty":2835,"uniform":2836,"progress":2837,"bar":2838,"launched":2839,"detailed":2840,"saving":2841,"whether":2842,"ttfs":2843,"metavar":2844,"keeping":2845,"purposes":2846,"dir":2847,"ignore":2848,"eos":2849,"flag":2850,"deepspeed_mii":2851,"comma":2852,"separated":2853,"percentils":2854,"specifies":2855,"th":2856,"definition":2857,"distserve":2858,"pdf":2859,"2401":2860,"09670":2861,"io":2862,"blogs":2863,"custom_group":2864,"add_argument_group":2865,"options":2866,"applying":2867,"sonnet_group":2868,"550":2869,"150":2870,"sharegpt_group":2871,"random_group":2872,"1024":2873,"hf_group":2874,"sampling_group":2875,"top":2876,"slow":2877,"preregistered":2878,"served":2879,"passed":2880,"launching":2881,"chooses":2882,"ending":2883,"readme":2884,"guides":2885,"tests":2886,"extensive":2887,"living":2888,"become":2889,"overview":2890,"table":2891,"style":2892,"border":2893,"collapse":2894,"thead":2895,"tr":2896,"left":2897,"65":2898,"tbody":2899,"td":2900,"strong":2901,"wget":2902,"co":2903,"anon8231489123":2904,"sharegpt_vicuna_unfiltered":2905,"resolve":2906,"sharegpt_v3_unfiltered_cleaned_split":2907,"sharegpt4v":2908,"lin":2909,"chen":2910,"sharegpt4v_instruct_gpt4":2911,"vision_cap100k":2912,"br":2913,"div":2914,"downloaded":2915,"separately":2916,"coco":2917,"cocodataset":2918,"zips":2919,"train2017":2920,"hpmll":2921,"burstgpt_without_fails_2":2922,"csv":2923,"synthetic":2924,"visionarena":2925,"lmarena":2926,"instructcoder":2927,"likaixin":2928,"aimo":2929,"mo":2930,"aime":2931,"numinamath":2932,"cot":2933,"lmms":2934,"onevision":2935,"aeala":2936,"jsonl":2937,"nousresearch":2938,"hermes":2939,"8b":2940,"78":2941,"1369":2942,"2212":2943,"73":2944,"382":2945,"89":2946,"619":2947,"85":2948,"71":2949,"54":2950,"88":2951,"p99":2952,"79":2953,"49":2954,"91":2955,"96":2956,"74":2957,"70":2958,"39":2959,"even":2960,"entry":2961,"india":2962,"iran":2963,"vllm_use_v1":2964,"instruct":2965,"9001":2966,"80":2967,"vision":2968,"capability":2969,"qwen":2970,"qwen2":2971,"vl":2972,"chart2text":2973,"cauldron":2974,"qwq":2975,"32b":2976,"42":2977,"philschmid":2978,"mt":2979,"ramping":2980,"stress":2981,"finding":2982,"handle":2983,"budget":2984,"two":2985,"strategies":2986,"increases":2987,"linearly":2988,"exponentially":2989,"4656":2990,"00":2991,"1072":2992,"5014":2993,"4036":2994,"92":2995,"326":2996,"14527":2997,"1280":2998,"vllm_worker_multiproc_method":2999,"spawn":3000,"104":3001,"77":3002,"23836":3003,"10477":3004,"261136":3005,"204800":3006,"loras":3007,